nc: 80  # 
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10,13, 16,30, 33,23]      # P3/8
  - [30,61, 62,45, 59,119]     # P4/16
  - [116,90, 156,198, 373,326] # P5/32

# -------------------- Backbone --------------------
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],      # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],        # 1-P2/4
   [-1, 3, C3, [128]],                # 2

   [-1, 1, Conv, [256, 3, 2]],        # 3-P3/8
   [-1, 6, C3, [256]],                # 4

   [-1, 1, Conv, [512, 3, 2]],        # 5-P4/16
   [-1, 9, C3, [512]],                # 6

   [-1, 1, Conv, [1024, 3, 2]],       # 7-P5/32
   [-1, 3, C3, [1024]],               # 8
   [-1, 1, CBAM, [1024]],             # 9 在 P5 加 CBAM
   [-1, 1, SPPF, [1024, 5]],           # 10
  ]

# -------------------- Head --------------------
head:
  [[-1, 1, Conv, [512, 1, 1]],         # 11
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],           # cat backbone P4
   [-1, 3, C3, [512, False]],           # 14

   [-1, 1, Conv, [256, 1, 1]],          # 15
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],           # cat backbone P3
   [-1, 3, C3, [256, False]],           # 18 (P3/8)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],           # cat head P4
   [-1, 3, C3, [512, False]],           # 21 (P4/16)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],           # cat backbone P5 (CBAM增强后)
   [-1, 3, C3, [1024, False]],          # 24 (P5/32)

   [[18, 21, 24], 1, Detect, [nc, anchors]],
  ]
